; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l27_p27_c27_g27_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(person-at person1 loc19)
	(person-at person2 loc20)
	(person-at person3 loc21)
	(person-at person4 loc2)
	(person-at person5 loc12)
	(person-at person6 loc2)
	(person-at person7 loc22)
	(person-at person8 loc18)
	(person-at person9 loc4)
	(person-at person10 loc7)
	(person-at person11 loc13)
	(person-at person12 loc22)
	(person-at person13 loc19)
	(person-at person14 loc13)
	(person-at person15 loc10)
	(person-at person16 loc15)
	(person-at person17 loc9)
	(person-at person18 loc26)
	(person-at person19 loc1)
	(person-at person20 loc8)
	(person-at person21 loc7)
	(person-at person22 loc15)
	(person-at person23 loc12)
	(person-at person24 loc3)
	(person-at person25 loc2)
	(person-at person26 loc15)
	(person-at person27 loc7)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person9 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person14 medicine)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person24 food)
	(has-content-person person24 medicine)
	(has-content-person person25 food)
	(has-content-person person26 medicine)
	(has-content-person person27 food)
))

(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate27 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate27 depot)
   added: (crate-at-space crate27 carrier1 space4)
   goals met: 1 of 28
2. (put-crate-in-carrier crate18 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space3)
   goals met: 1 of 28
3. (move-carrier depot loc26 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc26) (carrier-at carrier1 loc26)
   goals met: 0 of 28
4. (pick-and-drop crate18 loc26 drone1 carrier1 space3 person18 food)
   deleted: (crate-at-space crate18 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person18 food)
   goals met: 1 of 28
5. (move-carrier loc26 depot drone1 carrier1)
   deleted: (drone-at drone1 loc26) (carrier-at carrier1 loc26)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 28
6. (put-crate-in-carrier crate17 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space3)
   goals met: 2 of 28
7. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 1 of 28
8. (pick-and-drop crate17 loc21 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate17 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 2 of 28
9. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 28
10. (put-crate-in-carrier crate16 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space3)
   goals met: 3 of 28
11. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 2 of 28
12. (pick-and-drop crate16 loc9 drone1 carrier1 space3 person17 food)
   deleted: (crate-at-space crate16 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person17 food)
   goals met: 3 of 28
13. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 28
14. (put-crate-in-carrier crate15 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space3)
   goals met: 4 of 28
15. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 3 of 28
16. (pick-and-drop crate15 loc8 drone1 carrier1 space3 person20 food)
   deleted: (crate-at-space crate15 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person20 food)
   goals met: 4 of 28
17. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 28
18. (put-crate-in-carrier crate14 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space3)
   goals met: 5 of 28
19. (put-crate-in-carrier crate26 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate26 depot)
   added: (crate-at-space crate26 carrier1 space2)
   goals met: 5 of 28
20. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 4 of 28
21. (pick-and-drop crate26 loc19 drone1 carrier1 space2 person1 medicine)
   deleted: (crate-at-space crate26 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 medicine)
   goals met: 5 of 28
22. (pick-and-drop crate14 loc19 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate14 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 6 of 28
23. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 28
24. (put-crate-in-carrier crate13 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space3)
   goals met: 7 of 28
25. (put-crate-in-carrier crate25 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate25 depot)
   added: (crate-at-space crate25 carrier1 space2)
   goals met: 7 of 28
26. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 6 of 28
27. (pick-and-drop crate25 loc18 drone1 carrier1 space2 person8 medicine)
   deleted: (crate-at-space crate25 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person8 medicine)
   goals met: 7 of 28
28. (pick-and-drop crate13 loc18 drone1 carrier1 space3 person8 food)
   deleted: (crate-at-space crate13 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person8 food)
   goals met: 8 of 28
29. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 28
30. (put-crate-in-carrier crate12 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space3)
   goals met: 9 of 28
31. (put-crate-in-carrier crate24 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate24 depot)
   added: (crate-at-space crate24 carrier1 space2)
   goals met: 9 of 28
32. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 8 of 28
33. (pick-and-drop crate24 loc15 drone1 carrier1 space2 person22 medicine)
   deleted: (crate-at-space crate24 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person22 medicine)
   goals met: 9 of 28
34. (pick-and-drop crate12 loc15 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate12 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 10 of 28
35. (pick-and-drop crate27 loc15 drone1 carrier1 space4 person26 medicine)
   deleted: (crate-at-space crate27 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person26 medicine)
   goals met: 11 of 28
36. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 28
37. (put-crate-in-carrier crate23 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate23 depot)
   added: (crate-at-space crate23 carrier1 space4)
   goals met: 12 of 28
38. (put-crate-in-carrier crate11 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space3)
   goals met: 12 of 28
39. (put-crate-in-carrier crate22 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate22 depot)
   added: (crate-at-space crate22 carrier1 space2)
   goals met: 12 of 28
40. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 11 of 28
41. (pick-and-drop crate22 loc13 drone1 carrier1 space2 person11 medicine)
   deleted: (crate-at-space crate22 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person11 medicine)
   goals met: 12 of 28
42. (pick-and-drop crate11 loc13 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate11 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 13 of 28
43. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 14 of 28
44. (put-crate-in-carrier crate10 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space3)
   goals met: 14 of 28
45. (put-crate-in-carrier crate21 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate21 depot)
   added: (crate-at-space crate21 carrier1 space2)
   goals met: 14 of 28
46. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 13 of 28
47. (pick-and-drop crate21 loc13 drone1 carrier1 space2 person14 medicine)
   deleted: (crate-at-space crate21 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person14 medicine)
   goals met: 14 of 28
48. (pick-and-drop crate10 loc13 drone1 carrier1 space3 person14 food)
   deleted: (crate-at-space crate10 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person14 food)
   goals met: 15 of 28
49. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 16 of 28
50. (put-crate-in-carrier crate9 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space3)
   goals met: 16 of 28
51. (put-crate-in-carrier crate20 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate20 depot)
   added: (crate-at-space crate20 carrier1 space2)
   goals met: 16 of 28
52. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 15 of 28
53. (pick-and-drop crate20 loc4 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate20 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 16 of 28
54. (pick-and-drop crate9 loc4 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate9 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 17 of 28
55. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 18 of 28
56. (put-crate-in-carrier crate8 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space3)
   goals met: 18 of 28
57. (put-crate-in-carrier crate19 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate19 depot)
   added: (crate-at-space crate19 carrier1 space2)
   goals met: 18 of 28
58. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 17 of 28
59. (pick-and-drop crate19 loc3 drone1 carrier1 space2 person24 medicine)
   deleted: (crate-at-space crate19 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person24 medicine)
   goals met: 18 of 28
60. (pick-and-drop crate8 loc3 drone1 carrier1 space3 person24 food)
   deleted: (crate-at-space crate8 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person24 food)
   goals met: 19 of 28
61. (move-carrier loc3 loc1 drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 19 of 28
62. (pick-and-drop crate23 loc1 drone1 carrier1 space4 person19 medicine)
   deleted: (crate-at-space crate23 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person19 medicine)
   goals met: 20 of 28
63. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 21 of 28
64. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 21 of 28
65. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 20 of 28
66. (pick-and-drop crate7 loc1 drone1 carrier1 space4 person19 food)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person19 food)
   goals met: 21 of 28
67. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 22 of 28
68. (put-crate-in-carrier crate6 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space4)
   goals met: 22 of 28
69. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 22 of 28
70. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 21 of 28
71. (pick-and-drop crate5 loc12 drone1 carrier1 space3 person5 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person5 food)
   goals met: 22 of 28
72. (pick-and-drop crate6 loc12 drone1 carrier1 space4 person23 food)
   deleted: (crate-at-space crate6 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person23 food)
   goals met: 23 of 28
73. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 24 of 28
74. (put-crate-in-carrier crate4 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space4)
   goals met: 24 of 28
75. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 24 of 28
76. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 23 of 28
77. (pick-and-drop crate3 loc7 drone1 carrier1 space3 person21 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person21 food)
   goals met: 24 of 28
78. (pick-and-drop crate4 loc7 drone1 carrier1 space4 person27 food)
   deleted: (crate-at-space crate4 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person27 food)
   goals met: 25 of 28
79. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 26 of 28
80. (put-crate-in-carrier crate2 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space4)
   goals met: 26 of 28
81. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 26 of 28
82. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 25 of 28
83. (pick-and-drop crate1 loc2 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 26 of 28
84. (pick-and-drop crate2 loc2 drone1 carrier1 space4 person25 food)
   deleted: (crate-at-space crate2 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person25 food)
   goals met: 27 of 28
85. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 28 of 28
